In [1]:
import pandas as pd
from pandas import DataFrame, Series
s = Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
a = Series( s.values , index = ['a', 'b', 'c', 'd'])
a

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
dates = pd.date_range('2014-07-01', '2014-07-06')
dates

DatetimeIndex(['2014-07-01', '2014-07-02', '2014-07-03', '2014-07-04',
               '2014-07-05', '2014-07-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
b = Series([80, 82, 85, 90, 83, 87],index = dates)
b

2014-07-01    80
2014-07-02    82
2014-07-03    85
2014-07-04    90
2014-07-05    83
2014-07-06    87
Freq: D, dtype: int64

In [7]:
b.mean()

84.5

In [8]:
b2 = Series([70, 75, 69, 83, 79, 77],index = dates)
b2

2014-07-01    70
2014-07-02    75
2014-07-03    69
2014-07-04    83
2014-07-05    79
2014-07-06    77
Freq: D, dtype: int64

In [9]:
b2['2014-07-03']

69

In [10]:
bb2 = DataFrame({'Missoula': b,'Philadelphia': b2})
bb2

            Missoula  Philadelphia
2014-07-01        80            70
2014-07-02        82            75
2014-07-03        85            69
2014-07-04        90            83
2014-07-05        83            79
2014-07-06        87            77

In [11]:
bb2['Missoula']

2014-07-01    80
2014-07-02    82
2014-07-03    85
2014-07-04    90
2014-07-05    83
2014-07-06    87
Freq: D, Name: Missoula, dtype: int64

In [12]:
bb2.Missoula

2014-07-01    80
2014-07-02    82
2014-07-03    85
2014-07-04    90
2014-07-05    83
2014-07-06    87
Freq: D, Name: Missoula, dtype: int64

In [13]:
diff = bb2.Missoula - bb2.Philadelphia
diff

2014-07-01    10
2014-07-02     7
2014-07-03    16
2014-07-04     7
2014-07-05     4
2014-07-06    10
Freq: D, dtype: int64

In [14]:
mult = bb2.Missoula * bb2.Philadelphia
mult

2014-07-01    5600
2014-07-02    6150
2014-07-03    5865
2014-07-04    7470
2014-07-05    6557
2014-07-06    6699
Freq: D, dtype: int64

In [15]:
new = DataFrame({'Missoula': b,'Philadelphia': b2 , 'difference': diff , 'Multiply': mult})
new

            Missoula  Philadelphia  difference  Multiply
2014-07-01        80            70          10      5600
2014-07-02        82            75           7      6150
2014-07-03        85            69          16      5865
2014-07-04        90            83           7      7470
2014-07-05        83            79           4      6557
2014-07-06        87            77          10      6699

In [16]:
new.columns

Index(['Missoula', 'Philadelphia', 'difference', 'Multiply'], dtype='object')

In [17]:
new.difference[1:4]

2014-07-02     7
2014-07-03    16
2014-07-04     7
Freq: D, Name: difference, dtype: int64

In [20]:
new.iloc[4]

Missoula          83
Philadelphia      79
difference         4
Multiply        6557
Name: 2014-07-05 00:00:00, dtype: int64

In [21]:
new.ix[1].index

C:\Users\Shahzad Ahsan\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Index(['Missoula', 'Philadelphia', 'difference', 'Multiply'], dtype='object')

In [22]:
new.loc['2014-07-03']

Missoula          85
Philadelphia      69
difference        16
Multiply        5865
Name: 2014-07-03 00:00:00, dtype: int64

In [23]:
new.iloc[[1, 3, 5]].difference

2014-07-02     7
2014-07-04     7
2014-07-06    10
Freq: 2D, Name: difference, dtype: int64

In [24]:
new.iloc[[2,4,0]].Missoula

2014-07-03    85
2014-07-05    83
2014-07-01    80
Name: Missoula, dtype: int64

In [25]:
new.Missoula > 82

2014-07-01    False
2014-07-02    False
2014-07-03     True
2014-07-04     True
2014-07-05     True
2014-07-06     True
Freq: D, Name: Missoula, dtype: bool

In [28]:
new[new.Missoula > 82]

            Missoula  Philadelphia  difference  Multiply
2014-07-03        85            69          16      5865
2014-07-04        90            83           7      7470
2014-07-05        83            79           4      6557
2014-07-06        87            77          10      6699

In [ ]:
obj = pd.Series([4, 7, -5, 3 , 4, 7, 6],index = pd.RangeIndex(start = 0 , stop = 14 , step = 2))
obj.values

In [ ]:
obj.index

In [ ]:
obj1 = pd.Series([4, 7, -5, 6],index = ['a' , 'b' , 'c' ,'a'])
obj1.values

In [ ]:
obj1['e'] = 34

In [ ]:
obj1['a']sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [ ]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
sdata

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Utah', 'Texas']
states

In [ ]:
obj4 = pd.Series(sdata, index=states)
obj4